{"questions": [
    {
      "question": "Tell me about a time when you had to work with a difficult team member."
    },
    {
      "question": "Can you describe a project you led and the results you achieved?"
    },
    {
      "question": "Tell me about a time when you had to adapt to a change in plans or priorities."
    },
    {
      "question": "How do you handle stress and pressure in the workplace?"
    },
    {
      "question": "Tell me about a time when you had to make a difficult decision and what was the outcome?"
    },
    {
      "question": "Can you give an example of a goal you set and how you achieved it?"
    },
    {
      "question": "Tell me about a time when you received feedback or criticism. How did you respond?"
    },
    {
      "question": "Describe a situation where you had to work with someone who had a different work style or perspective."
    },
    {
      "question": "Tell me about a time when you went above and beyond for a customer or client."
    },
    {
      "question": "Can you tell me about a time when you identified a problem and implemented a solution?"
    },
    {
      "question": "How do you prioritize tasks and manage your time?"
    },
    {
      "question": "Tell me about a team you were part of and your role within it."
    },
    {
      "question": "Can you describe a situation where you had to communicate complex information to someone?"
    },
    {
      "question": "Tell me about a time when you received recognition or an award for your work."
    },
    {
      "question": "How do you handle a heavy workload or multiple projects simultaneously?"
    },
    {
      "question": "Tell me about a time when you had to negotiate or mediate a conflict."
    },
    {
      "question": "Can you give an example of a creative solution you came up with to solve a problem?"
    },
    {
      "question": "Describe a situation where you had to learn a new skill or technology quickly."
    },
    {
      "question": "Tell me about a time when you took initiative on a project or task."
    },
    {
      "question": "Can you tell me about a time when you received feedback that changed your approach to work?"
    }
  ]
}